In [6]:
from pandas import DataFrame

In [7]:
data = {'Estado':["Santa Catarina",'Paraná','Goias','Bahia','Minas Gerais'],
       'Ano':[2002,2003,2004,2005,2006],
       'População':[1.5,1.7,3.6,2.4,2.9]}

In [8]:
frame = DataFrame(data)

In [9]:
frame

           Estado   Ano  População
0  Santa Catarina  2002        1.5
1          Paraná  2003        1.7
2           Goias  2004        3.6
3           Bahia  2005        2.4
4    Minas Gerais  2006        2.9

In [10]:
type(frame)

pandas.core.frame.DataFrame

In [11]:
DataFrame(data, columns=['Ano', 'Estado', 'População'])

    Ano          Estado  População
0  2002  Santa Catarina        1.5
1  2003          Paraná        1.7
2  2004           Goias        3.6
3  2005           Bahia        2.4
4  2006    Minas Gerais        2.9

In [12]:
frame2 = DataFrame(data, columns = ['Ano', 'Estado', 'População', 'Débito'],
                  index = ['um', 'dois', 'três', 'quatro','cinco'])

In [13]:
frame2

         Ano          Estado  População Débito
um      2002  Santa Catarina        1.5    NaN
dois    2003          Paraná        1.7    NaN
três    2004           Goias        3.6    NaN
quatro  2005           Bahia        2.4    NaN
cinco   2006    Minas Gerais        2.9    NaN

In [14]:
frame2['Estado']

um        Santa Catarina
dois              Paraná
três               Goias
quatro             Bahia
cinco       Minas Gerais
Name: Estado, dtype: object

In [15]:
frame2[:2]

       Ano          Estado  População Débito
um    2002  Santa Catarina        1.5    NaN
dois  2003          Paraná        1.7    NaN

In [16]:
import numpy as np

In [17]:
frame2['Débito'] = np.arange(5.)

In [18]:
frame2

         Ano          Estado  População  Débito
um      2002  Santa Catarina        1.5     0.0
dois    2003          Paraná        1.7     1.0
três    2004           Goias        3.6     2.0
quatro  2005           Bahia        2.4     3.0
cinco   2006    Minas Gerais        2.9     4.0

In [19]:
frame2.values

array([[2002, 'Santa Catarina', 1.5, 0.0],
       [2003, 'Paraná', 1.7, 1.0],
       [2004, 'Goias', 3.6, 2.0],
       [2005, 'Bahia', 2.4, 3.0],
       [2006, 'Minas Gerais', 2.9, 4.0]], dtype=object)

In [20]:
frame2.describe()

               Ano  População    Débito
count     5.000000   5.000000  5.000000
mean   2004.000000   2.420000  2.000000
std       1.581139   0.864292  1.581139
min    2002.000000   1.500000  0.000000
25%    2003.000000   1.700000  1.000000
50%    2004.000000   2.400000  2.000000
75%    2005.000000   2.900000  3.000000
max    2006.000000   3.600000  4.000000

In [21]:
frame2['dois':'quatro']

         Ano  Estado  População  Débito
dois    2003  Paraná        1.7     1.0
três    2004   Goias        3.6     2.0
quatro  2005   Bahia        2.4     3.0

In [22]:
frame2 < 5

          Ano  Estado  População  Débito
um      False    True       True    True
dois    False    True       True    True
três    False    True       True    True
quatro  False    True       True    True
cinco   False    True       True    True

In [23]:
frame2.loc['quatro']

Ano           2005
Estado       Bahia
População      2.4
Débito           3
Name: quatro, dtype: object

In [25]:
frame2.iloc[2]

Ano           2004
Estado       Goias
População      3.6
Débito           2
Name: três, dtype: object

In [26]:
web_stats = {'Dias':[1,2,3,4,5,6,7],
            'Visitantes':[45,23,67,78,23,12,14],
            'Taxas':[11,22,33,44,55,66,77]}

In [28]:
df = DataFrame(web_stats)

In [29]:
print(df)

   Dias  Visitantes  Taxas
0     1          45     11
1     2          23     22
2     3          67     33
3     4          78     44
4     5          23     55
5     6          12     66
6     7          14     77

In [30]:
print(df.set_index('Dias'))

      Visitantes  Taxas
Dias
1             45     11
2             23     22
3             67     33
4             78     44
5             23     55
6             12     66
7             14     77

In [31]:
print(df.head)

<bound method NDFrame.head of    Dias  Visitantes  Taxas
0     1          45     11
1     2          23     22
2     3          67     33
3     4          78     44
4     5          23     55
5     6          12     66
6     7          14     77>

In [32]:
print(df['Visitantes'])

0    45
1    23
2    67
3    78
4    23
5    12
6    14
Name: Visitantes, dtype: int64

In [34]:
print(df[['Visitantes','Taxas']])

   Visitantes  Taxas
0          45     11
1          23     22
2          67     33
3          78     44
4          23     55
5          12     66
6          14     77